# SSDLite with Mobilenet v2 configuration for VOC Dataset.

model {
  ssd {
    num_classes: 20
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 300
      }
    }
    feature_extractor {
      type: 'ssd_mobilenet_v2'
      depth_multiplier: 1.0
      min_depth: 16
      use_depthwise: true
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.03
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.9997
          center: true
          scale: true
          epsilon: 0.001
        }
      }
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            truncated_normal_initializer {
              mean: 0.0
              stddev: 0.03
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.9997
            center: true
            scale: true
            epsilon: 0.001
          }
        }
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 3
        box_code_size: 4
        apply_sigmoid_to_scores: false
        use_depthwise: true
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.95
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.3333
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid {
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
      hard_example_miner {
        num_hard_examples: 3000
        iou_threshold: 0.99
        loss_type: CLASSIFICATION
        max_negatives_per_positive: 3
        min_negatives_per_image: 3
      }
    }
  }
}
train_config: {
  batch_size: 64
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
  sync_replicas: true
  optimizer {
    adam_optimizer: {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: .0002
          schedule {
            step: 500
            learning_rate: .00003
          }
          schedule {
            step: 1000
            learning_rate: .000003
          }
          schedule {
            step: 3000
            learning_rate: .0000003
          }
          schedule {
            step: 6000
            learning_rate: .00000003
          }
        }
      }
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "CKPT_DIR_TO_CONFIGURE/model.ckpt"
  from_detection_checkpoint: true
  load_all_detection_checkpoint_vars: true
  num_steps: 50000
  startup_delay_steps: 0.0
  replicas_to_aggregate: 8
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  freeze_variables:
        [ 'FeatureExtractor/MobilenetV2/Conv/',
          'FeatureExtractor/MobilenetV2/expanded_conv/',
          'FeatureExtractor/MobilenetV2/expanded_conv_1/',
          'FeatureExtractor/MobilenetV2/expanded_conv_2/',
          'FeatureExtractor/MobilenetV2/expanded_conv_3/',
          'FeatureExtractor/MobilenetV2/expanded_conv_4/',
          'FeatureExtractor/MobilenetV2/expanded_conv_5/',
          'FeatureExtractor/MobilenetV2/expanded_conv_6/',
          'FeatureExtractor/MobilenetV2/expanded_conv_7/']
}
train_input_reader: {
  label_map_path: "DATASET_DIR_TO_CONFIGURE/pascal_label_map.pbtxt"
  tf_record_input_reader {
    input_path: "DATASET_DIR_TO_CONFIGURE/pascal_train.record"
  }
}
eval_config: {
  num_examples: 10
  num_visualizations: 10
  eval_interval_secs: 0
}
eval_input_reader: {
  label_map_path: "DATASET_DIR_TO_CONFIGURE/pascal_label_map.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "DATASET_DIR_TO_CONFIGURE/pascal_val.record"
  }
}
graph_rewriter {
  quantization {
    delay: 48000
    weight_bits: 8
    activation_bits: 8
  }
}
